In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import datetime

In [2]:
campaign_master = pd.read_csv("campaign_master.csv")
class_master = pd.read_csv("class_master.csv")
customer_master = pd.read_csv("customer_master.csv")
use_log = pd.read_csv("use_log.csv")

In [3]:
campaign_master.head()

  campaign_id campaign_name
0         CA1            通常
1         CA2         入会費半額
2         CA3         入会費無料

In [4]:
class_master.head()

  class class_name  price
0   C01     オールタイム  10500
1   C02      デイタイム   7500
2   C03        ナイト   6000

In [5]:
customer_master.head()

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0
4,HD661448,XXXXX,C03,F,2015-05-01 00:00:00,NaN,CA1,0

In [6]:
len(customer_master)

4192

In [7]:
use_log.head()

            log_id customer_id     usedate
0  L00000049012330    AS009373  2018-04-01
1  L00000049012331    AS015315  2018-04-01
2  L00000049012332    AS040841  2018-04-01
3  L00000049012333    AS046594  2018-04-01
4  L00000049012334    AS073285  2018-04-01

In [8]:
len(use_log)

197428

customer_master, class_master, campaign_masterをつなげる

In [9]:
#はじめにcustomer_masterとclass_masterをつなげる

united1 = pd.merge(customer_master, class_master, on = "class")
united1

#次にcampaign_masterをつなげる

united2 = pd.merge(united1, campaign_master, on = "campaign_id")
united2

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,class_name,price,campaign_name
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
4,IK271057,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
...,...,...,...,...,...,...,...,...,...,...,...
4187,IK562610,XXXXX,C02,F,2018-12-13 00:00:00,2019-02-28 00:00:00,CA3,1,デイタイム,7500,入会費無料
4188,HI599354,XXXX,C02,M,2018-12-13 00:00:00,NaN,CA3,0,デイタイム,7500,入会費無料
4189,GD796859,XX,C02,F,2018-12-14 00:00:00,NaN,CA3,0,デイタイム,7500,入会費無料
4190,GD082270,XXXX,C02,F,2018-12-14 00:00:00,2019-02-28 00:00:00,CA3,1,デイタイム,7500,入会費無料
4191,OA426023,XXXX,C02,F,2018-12-14 00:00:00,NaN,CA3,0,デイタイム,7500,入会費無料

In [10]:
# 結合の前後で行数が変わらない事を確認

print(len(customer_master))
print(len(united2))

4192
4192

In [11]:
# 欠損値の確認

united2.isnull().sum()

customer_id         0
name                0
class               0
gender              0
start_date          0
end_date         2842
campaign_id         0
is_deleted          0
class_name          0
price               0
campaign_name       0
dtype: int64

# ここから自身の解答

会員区分、キャンペーン区分、性別、退会済毎の人数を集計する

In [12]:
#会員区分毎の数を集計

united2["class_name"].value_counts()

オールタイム    2045
ナイト       1128
デイタイム     1019
Name: class_name, dtype: int64

In [13]:
#キャンペーン区分毎の数を集計

united2["campaign_name"].value_counts()

通常       3050
入会費半額     650
入会費無料     492
Name: campaign_name, dtype: int64

In [14]:
#性別毎の数を集計

united2["gender"].value_counts()

M    2209
F    1983
Name: gender, dtype: int64

In [15]:
#退会済の数を集計

united2["is_deleted"].value_counts()

0    2842
1    1350
Name: is_deleted, dtype: int64

次に、2018年4月1日から2019年3月31日までに入会(スタート)した人の数を調べる

In [16]:
#start_dateのデータ型を調べる

united2["start_date"]

0       2015-05-01 00:00:00
1       2015-05-01 00:00:00
2       2015-05-01 00:00:00
3       2015-05-01 00:00:00
4       2015-05-01 00:00:00
               ...
4187    2018-12-13 00:00:00
4188    2018-12-13 00:00:00
4189    2018-12-14 00:00:00
4190    2018-12-14 00:00:00
4191    2018-12-14 00:00:00
Name: start_date, Length: 4192, dtype: object

In [17]:
#objectというのが分かったので、日付型に変換する

united2["start_date"] = pd.to_datetime(united2["start_date"])
united2["start_date"]

0      2015-05-01
1      2015-05-01
2      2015-05-01
3      2015-05-01
4      2015-05-01
          ...
4187   2018-12-13
4188   2018-12-13
4189   2018-12-14
4190   2018-12-14
4191   2018-12-14
Name: start_date, Length: 4192, dtype: datetime64[ns]

In [18]:
united2

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,class_name,price,campaign_name
0,OA832399,XXXX,C01,F,2015-05-01,NaN,CA1,0,オールタイム,10500,通常
1,PL270116,XXXXX,C01,M,2015-05-01,NaN,CA1,0,オールタイム,10500,通常
2,OA974876,XXXXX,C01,M,2015-05-01,NaN,CA1,0,オールタイム,10500,通常
3,HD024127,XXXXX,C01,F,2015-05-01,NaN,CA1,0,オールタイム,10500,通常
4,IK271057,XXXXX,C01,M,2015-05-01,NaN,CA1,0,オールタイム,10500,通常
...,...,...,...,...,...,...,...,...,...,...,...
4187,IK562610,XXXXX,C02,F,2018-12-13,2019-02-28 00:00:00,CA3,1,デイタイム,7500,入会費無料
4188,HI599354,XXXX,C02,M,2018-12-13,NaN,CA3,0,デイタイム,7500,入会費無料
4189,GD796859,XX,C02,F,2018-12-14,NaN,CA3,0,デイタイム,7500,入会費無料
4190,GD082270,XXXX,C02,F,2018-12-14,2019-02-28 00:00:00,CA3,1,デイタイム,7500,入会費無料
4191,OA426023,XXXX,C02,F,2018-12-14,NaN,CA3,0,デイタイム,7500,入会費無料

In [19]:
#最も最近の入会日を調べる

united2["start_date"].max()

Timestamp('2019-03-15 00:00:00')

In [20]:
united2["start_date"].sort_values()

0      2015-05-01
2308   2015-05-01
2309   2015-05-01
2310   2015-05-01
2311   2015-05-01
          ...
1465   2019-03-14
2305   2019-03-14
1464   2019-03-14
1466   2019-03-14
3049   2019-03-15
Name: start_date, Length: 4192, dtype: datetime64[ns]

In [21]:
#2018-4-1以降に入会した人の人数を調べる

len(united2.loc[united2["start_date"] > "2018-4-1",["start_date"]])

1361

# ここから自身の解答

use_logの情報から、3月に利用した会員の数を調べる。

In [22]:
# まずは、use_logをunited2に結合する

united3 = pd.merge(united2, use_log, on = "customer_id")
united3

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,class_name,price,campaign_name,log_id,usedate
0,OA832399,XXXX,C01,F,2015-05-01,NaN,CA1,0,オールタイム,10500,通常,L00000049014216,2018-04-04
1,OA832399,XXXX,C01,F,2015-05-01,NaN,CA1,0,オールタイム,10500,通常,L00000049018989,2018-04-13
2,OA832399,XXXX,C01,F,2015-05-01,NaN,CA1,0,オールタイム,10500,通常,L00000049030118,2018-05-03
3,OA832399,XXXX,C01,F,2015-05-01,NaN,CA1,0,オールタイム,10500,通常,L00000049031667,2018-05-06
4,OA832399,XXXX,C01,F,2015-05-01,NaN,CA1,0,オールタイム,10500,通常,L00000049033751,2018-05-10
...,...,...,...,...,...,...,...,...,...,...,...,...,...
197423,OA426023,XXXX,C02,F,2018-12-14,NaN,CA3,0,デイタイム,7500,入会費無料,L00000049200630,2019-03-14
197424,OA426023,XXXX,C02,F,2018-12-14,NaN,CA3,0,デイタイム,7500,入会費無料,L00000049201168,2019-03-15
197425,OA426023,XXXX,C02,F,2018-12-14,NaN,CA3,0,デイタイム,7500,入会費無料,L00000049204337,2019-03-21
197426,OA426023,XXXX,C02,F,2018-12-14,NaN,CA3,0,デイタイム,7500,入会費無料,L00000049204848,2019-03-22
197427,OA426023,XXXX,C02,F,2018-12-14,NaN,CA3,0,デイタイム,7500,入会費無料,L00000049208576,2019-03-29

In [23]:
# usedateに欠損値が無いか確認

united3["usedate"].isnull().any()

False

In [24]:
# usedateのデータ型を確認

united3["usedate"]

0         2018-04-04
1         2018-04-13
2         2018-05-03
3         2018-05-06
4         2018-05-10
             ...
197423    2019-03-14
197424    2019-03-15
197425    2019-03-21
197426    2019-03-22
197427    2019-03-29
Name: usedate, Length: 197428, dtype: object

In [25]:
# object型を日付型に変更

united3["usedate"] = pd.to_datetime(united3["usedate"])
united3["usedate"]

0        2018-04-04
1        2018-04-13
2        2018-05-03
3        2018-05-06
4        2018-05-10
            ...
197423   2019-03-14
197424   2019-03-15
197425   2019-03-21
197426   2019-03-22
197427   2019-03-29
Name: usedate, Length: 197428, dtype: datetime64[ns]

In [26]:
# 2019年3月に利用した人の数を集計する。同月に何回も利用している会員がいるはずなので、そこに気を付ける。

len(united3.loc[united3["usedate"] >= "2019-03-01", "customer_id"].unique())

2953

2019年3月の利用者数は2953名というのが分かった。

次に、この中での会員区分、キャンペーン区分、性別毎の数を集計する。

In [27]:
# まず、2019年3月の利用者数だけのデータフレームを作成

united4 = united3.loc[united3["usedate"] >= "2019-03-01", :]
united4.head()

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,class_name,price,campaign_name,log_id,usedate
54,OA832399,XXXX,C01,F,2015-05-01,NaN,CA1,0,オールタイム,10500,通常,L00000049198485,2019-03-10
55,OA832399,XXXX,C01,F,2015-05-01,NaN,CA1,0,オールタイム,10500,通常,L00000049202236,2019-03-17
56,OA832399,XXXX,C01,F,2015-05-01,NaN,CA1,0,オールタイム,10500,通常,L00000049205885,2019-03-24
57,OA832399,XXXX,C01,F,2015-05-01,NaN,CA1,0,オールタイム,10500,通常,L00000049209621,2019-03-31
114,PL270116,XXXXX,C01,M,2015-05-01,NaN,CA1,0,オールタイム,10500,通常,L00000049195471,2019-03-04

In [45]:
# cutomer_idとclass_nameでグループ化

united5 = united4.groupby(["customer_id","class_name"]).sum()
united5

                        is_deleted  price
customer_id class_name
AS002855    ナイト                  0  24000
AS008805    オールタイム               1  10500
AS009373    オールタイム               0  52500
AS015233    オールタイム               0  84000
AS015315    オールタイム               0  42000
...                            ...    ...
TS995853    オールタイム               0  84000
TS998593    ナイト                  0  48000
TS999079    ナイト                  0  18000
TS999231    オールタイム               0  63000
TS999855    オールタイム               0  42000

[2953 rows x 2 columns]

In [46]:
# class_nameをcolumnsに戻して集計。これで3月の会員区分毎の会員数が集計された。

united5.pivot_table(columns = "class_name", aggfunc = "size")

class_name
オールタイム    1444
デイタイム      696
ナイト        813
dtype: int64

In [49]:
# 同様にキャンペーン区分毎の会員数も集計

united4.groupby(["customer_id","campaign_name"]).sum().pivot_table(columns = "campaign_name", aggfunc = "size")

campaign_name
入会費半額     311
入会費無料     242
通常       2400
dtype: int64

In [50]:
# 同様に性別毎の会員数も集計

united4.groupby(["customer_id","gender"]).sum().pivot_table(columns = "gender", aggfunc = "size")

gender
F    1400
M    1553
dtype: int64